cfg/Catalogs/УдалитьДополнительныеПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>УдалитьДополнительныеПечатныеФормы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/УдалитьДополнительныеПечатныеФормы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Перем мОбновитьФайлОбработки, мТекущаяСтрока;

Процедура ПринадлежностьПередНачаломДобавления(Элемент, Отказ, Копирование)
	Отказ = Истина;
	Форма = ПолучитьФорму("ФормаВыбораПринадлежности", Элемент);
	Форма.РежимВыбора = Истина;
	Форма.УжеВыбранные = СтуктураЗаполненных();
	мТекущаяСтрока = Неопределено;
	Если Форма.Открыта() Тогда
		Форма.СписокДокументов.Очистить();
	КонецЕсли;
	Форма.Открыть();
КонецПроцедуры


Процедура ПринадлежностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЕСли мТекущаяСтрока = Неопределено Тогда
		НоваяСтрока = Принадлежность.Добавить();
	Иначе
		НоваяСтрока = мТекущаяСтрока;
	КонецЕсли;	
		
	//НоваяСтрока.ИмяОбъектаМетаданных = ВыбранноеЗначение.ПолноеИмя();
	Если Метаданные.Документы.Содержит(ВыбранноеЗначение) Тогда
		НоваяСтрока.СсылкаОбъекта = Документы[ВыбранноеЗначение.Имя].ПустаяСсылка();
		НоваяСтрока.ПредставлениеОбъекта = "Документ """ + ?(ВыбранноеЗначение.Синоним="", ВыбранноеЗначение.Имя, ВыбранноеЗначение.Синоним)+"""";
	ИначеЕсли Метаданные.Справочники.Содержит(ВыбранноеЗначение) Тогда
		НоваяСтрока.СсылкаОбъекта = Справочники[ВыбранноеЗначение.Имя].ПустаяСсылка();
		НоваяСтрока.ПредставлениеОбъекта = "Справочник """ + ?(ВыбранноеЗначение.Синоним="", ВыбранноеЗначение.Имя, ВыбранноеЗначение.Синоним)+"""";
	КонецЕслИ;	
	
КонецПроцедуры

Функция СтуктураЗаполненных(ТекущийОбъект = Неопределено)
	Результат = Новый Соответствие;
	Для Каждого СтрокаПринадлежности ИЗ Принадлежность Цикл		
		ЕСли ТекущийОбъект = Неопределено Тогда
			Результат.Вставить(СтрокаПринадлежности.СсылкаОбъекта.Метаданные(), Истина);
		ИначеЕсли ТекущийОбъект <> Неопределено И СтрокаПринадлежности.СсылкаОбъекта <> ТекущийОбъект Тогда
			Результат.Вставить(СтрокаПринадлежности.СсылкаОбъекта.Метаданные(), Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ПринадлежностьПредставлениеОбъектаНачалоВыбора(Элемент, СтандартнаяОбработка)
	Форма = ПолучитьФорму("ФормаВыбораПринадлежности", ЭлементыФормы.Принадлежность);
	Форма.РежимВыбора = Истина;
	Форма.УжеВыбранные = СтуктураЗаполненных(ЭлементыФормы.Принадлежность.ТекущиеДанные.СсылкаОбъекта);
	мТекущаяСтрока = ЭлементыФормы.Принадлежность.ТекущаяСтрока;
	Если Форма.Открыта() Тогда
		Форма.СписокДокументов.Очистить();
	КонецЕсли;
	Форма.Открыть();
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если мОбновитьФайлОбработки Тогда
		Если ИмяФайлаВнешнейОбработки = "" Тогда
			Предупреждение(НСтр("ru='Не выбран файл внешней обработки';uk='Не обраний файл зовнішньої обробки'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайлаВнешнейОбработки));
	КонецЕсли;
КонецПроцедуры

Процедура ВыборФайлаНажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФайла.Фильтр = "Внещняя обработка(*.epf)|*.epf";
	ЕСли ДиалогФайла.Выбрать() Тогда
		ИмяФайлаВнешнейОбработки = ДиалогФайла.ПолноеИмяФайла;
		Попытка
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайлаВнешнейОбработки);
			Если НЕ ЗначениеЗаполнено(Наименование) Тогда
				Наименование = ВнешняяОбработка.Метаданные().Синоним;
			КонецЕсли;
		Исключение
			Предупреждение(НСтр("ru='Выбранный файл не является внешней обработкой."
"Либо, данная обработка не предназначена для"
"запуска в этой конфигурации.';uk='Обраний файл не є зовнішньою обробкою."
"Або, дана обробка не призначена для"
"запуску в цій конфігурації.'"));
			ИмяФайлаВнешнейОбработки = "";
			Возврат
		КонецПопытки ;
		
		Если ВнешняяОбработка.Метаданные().Макеты.Найти("Параметры_Авторегистрации")<>Неопределено Тогда
		 	Макет = ВнешняяОбработка.ПолучитьМакет("Параметры_Авторегистрации");
			СписокПринадлежности = Новый СписокЗначений;
			Для индекс = 1 по Макет.ВысотаТаблицы Цикл
				Попытка
					ВидОбъектаСтр = Макет.Область(индекс, 1, индекс, 1).Текст;
					ЕСли Лев(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")-1) = "Документы" Тогда
						Попытка
							СписокПринадлежности.Добавить(Документы[Сред(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")+1)].ПустаяСсылка());
						Исключение
							
						КонецПопытки;
					ИначеЕсли Лев(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")-1)  = "Справочники" Тогда
						Попытка
							СписокПринадлежности.Добавить(Справочники[Сред(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")+1)].ПустаяСсылка());
						Исключение
						КонецПопытки;						
					КонецЕсли;
		
				Исключение					
				КонецПопытки;
			КонецЦикла;
			Если СписокПринадлежности.Количество() > 0 Тогда
				Ответ = Вопрос(НСтр("ru='Указанная внешняя печатная форма содержит параметры авторегистрации. Использовать их при регистрации?';uk='Вказана зовнішня друкована форма містить параметри автореєстрації. Використовувати їх при реєстрації?'"), РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Для Каждого ЭлементСписка Из СписокПринадлежности Цикл
						Если Принадлежность.Найти(ЭлементСписка.Значение, "СсылкаОбъекта") = Неопределено Тогда
							НоваяСтрока = Принадлежность.Добавить();			
							НоваяСтрока.СсылкаОбъекта = ЭлементСписка.Значение;
							МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(ЭлементСписка.Значение));
							Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
								НоваяСтрока.ПредставлениеОбъекта = "Документ """ + ?(МетаданныеОбъекта.Синоним = "", МетаданныеОбъекта.Имя, МетаданныеОбъекта.Синоним) + """";
							ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
								НоваяСтрока.ПредставлениеОбъекта = "Справочник """ + ?(МетаданныеОбъекта.Синоним = "", МетаданныеОбъекта.Имя, МетаданныеОбъекта.Синоним) + """";
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕСли;
		
		ЭлементыФормы.ВыборФайла.Заголовок = НСтр("ru='Изменить файл внешней обработки';uk='Змінити файл зовнішньої обробки'");		
		ЭлементыФормы.ВыборФайла.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		мОбновитьФайлОбработки = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()	
	Если ЭтоНовый() Тогда
		ЭлементыФормы.ВыборФайла.Заголовок = НСтр("ru='Укажите файл внешней обработки';uk='Вкажіть файл зовнішньої обробки'");		
		ЭлементыФормы.ВыборФайла.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
		мОбновитьФайлОбработки = Истина;
	КонецЕсли;
КонецПроцедуры

//Процедура ПринадлежностьПредставлениеОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	Если мТекущаяСтрока = Неопределено Тогда
//		Возврат;
//	КонецЕсли;		
//		
//КонецПроцедуры

мОбновитьФайлОбработки = Ложь;
